{
  "backend/main.mo": "Motoko actor defining a Game type and CRUD operations (add, get, delete, list, filter by category, increment play count, get most popular) backed by a Map, with blob storage mixin included.",
  "feature_evidence.json": "Feature evidence report mapping a single feature (rewriting RetroBowlGame.tsx into a full Retro Bowl clone) to its target file, component dependencies, and test ID REQ-59.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of every frontend source file, serving as a pre-built reference for build planning.",
  "frontend/index.css": "Tailwind base/components/utilities entry with OKLCH CSS custom property tokens for light and dark themes covering background, foreground, card, border, chart, and sidebar colors.",
  "frontend/index.html": "HTML shell for the React app titled 'Random Arcade', importing Exo 2 and Chakra Petch from Google Fonts and mounting the app via /src/main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with a root layout (Navigation + Footer), an index route for HomePage, and a dynamic /game/$title route for GamePage, wrapped in a React Query provider.",
  "frontend/src/components/FeaturedGameHero.tsx": "Hero section component displaying a featured game's thumbnail, title, description, play count, category badge, and a neon 'Play Now' button with gradient overlays.",
  "frontend/src/components/Footer.tsx": "Site footer showing the Random Arcade brand, dynamic copyright year, and a caffeine.ai attribution link with UTM parameters derived from the current hostname.",
  "frontend/src/components/GameCard.tsx": "Linked game card component rendering a thumbnail with hover play-button overlay, title, category badge, and play count, with neon glow colors keyed to game category.",
  "frontend/src/components/games/AmongUsGame.tsx": "Empty file with no implementation.",
  "frontend/src/components/games/AsteroidsGame.tsx": "Implements a canvas-based Asteroids game with ship movement, shooting, asteroid splitting, collision detection, score tracking, and neon visual styling.",
  "frontend/src/components/games/BlockBlastGame.tsx": "Empty file with no implementation.",
  "frontend/src/components/games/BreakoutGame.tsx": "Empty file with no implementation.",
  "frontend/src/components/games/DinoRunnerGame.tsx": "Implements a canvas-based endless runner game where a dino jumps over procedurally spawned cacti, with increasing speed, collision detection, and score tracking.",
  "frontend/src/components/games/FlappyBirdGame.tsx": "Empty file with no implementation.",
  "frontend/src/components/games/Game2048.tsx": "Empty file with no implementation.",
  "frontend/src/components/games/GeometryDashGame.tsx": "Empty file with no implementation.",
  "frontend/src/components/games/MemoryMatchGame.tsx": "Implements a React-based memory card matching game with 8 symbol pairs, flip/match logic, move counter, elapsed timer, and win detection.",
  "frontend/src/components/games/MinesweeperGame.tsx": "Implements a 9x9 Minesweeper game with mine placement on first click, flood-fill reveal, flagging, win/loss detection, and an elapsed timer.",
  "frontend/src/components/games/PacManGame.tsx": "Empty file with no implementation.",
  "frontend/src/components/games/PongGame.tsx": "Implements a two-player canvas-based Pong game with keyboard controls, ball physics, paddle collision, score tracking, and a first-to-7 win condition.",
  "frontend/src/components/games/RetroBowlGame.tsx": "A full-featured retro-style American football game rendered on an HTML5 canvas, implementing game phases, player/defender AI, passing, running, field goals, scoring, and HUD display.",
  "frontend/src/components/games/SixSevenGame.tsx": "Empty file with no content or implementation.",
  "frontend/src/components/games/SnakeGame.tsx": "Empty file with no content or implementation.",
  "frontend/src/components/games/SpaceInvadersGame.tsx": "Empty file with no content or implementation.",
  "frontend/src/components/games/SwordsAndSandalsGame.tsx": "A turn-based gladiator combat game rendered on a canvas with attack, block, and special move actions, featuring shake/flash animations, HP tracking, and round progression.",
  "frontend/src/components/games/TetrisGame.tsx": "Empty file with no content or implementation.",
  "frontend/src/components/games/TungTungGame.tsx": "Empty file with no content or implementation.",
  "frontend/src/components/games/WhackAMoleGame.tsx": "A 3x3 grid Whack-a-Mole game with a 30-second timer, randomly popping moles, click-to-whack scoring, and idle/playing/over states.",
  "frontend/src/components/Navigation.tsx": "Renders a sticky top navigation bar with a logo linking to the home page and a 'Game Library' nav link, styled with neon colors.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flows, identity persistence, and delegation validity checks.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching games (all, by category, most popular), incrementing play counts, and adding new games via the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines a dark cyberpunk/neon design system via CSS custom properties (oklch colors), and adds utility classes for neon text glows, neon borders, grid backgrounds, scanlines, and font families (Chakra Petch, Exo 2).",
  "frontend/src/lib/seedGames.ts": "Defines a list of 8 seed games (Whack-a-Mole, Dino Runner, Pong, etc.) and exports a `seedInitialGames` function that checks existing backend games and adds any missing ones to avoid duplicates.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider (React Query) and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/GamePage.tsx": "Route page that maps URL title params to specific game components via GAME_MAP, increments the play count on mount, and renders the matched game or a 404 state with a back link.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that seeds initial games on actor load, displays a featured hero for Dino Runner, renders category filter buttons, and shows a responsive grid of GameCard components with loading skeletons and empty states.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with neon color palette, custom fonts (Chakra Petch, Exo 2), neon box-shadow variants, and keyframe animations (neon-pulse, float, accordion), plus the tailwindcss-animate and typography plugins.",
  "project_state.json": "Project state manifest (version 37) tracking the platform summary, architectural notes, known issues, and a list of existing implemented features for the web-based multi-game arcade platform."
}