{
  "backend/main.mo": "Motoko actor defining a game library backend with CRUD operations for games (add, delete, get by title/category, list all, increment play count, get most popular), using a Map for storage and including a blob storage mixin.",
  "feature_evidence.json": "Feature evidence report documenting that the TungTungGame component should use a static image asset (tung-character.dim_300x300.png) as the clickable character with idle pulse and click shake/flash effects.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, serving as a reference index for the project's frontend components, pages, hooks, and styles.",
  "frontend/index.css": "Tailwind CSS entry file defining CSS custom property tokens for light and dark themes using OKLCH color values for backgrounds, foregrounds, borders, and chart colors.",
  "frontend/index.html": "HTML entry point for the React app, setting the page title to 'Kash is Fart', loading Orbitron and Rajdhani fonts from Google Fonts, and mounting the app via main.tsx.",
  "frontend/src/App.tsx": "Root React app file configuring TanStack Router with a root layout (Navigation + Footer), an index route for HomePage, and a dynamic /game/$title route for GamePage, wrapped in a QueryClientProvider.",
  "frontend/src/components/FeaturedGameHero.tsx": "Hero banner component that prominently displays a featured game's thumbnail, title, description, play count, category badge, and a 'Play Now' CTA button with neon arcade styling.",
  "frontend/src/components/Footer.tsx": "Footer component displaying the 'KASH IS FART' brand, dynamic copyright year, and a caffeine.ai attribution link with UTM tracking parameters.",
  "frontend/src/components/GameCard.tsx": "Reusable game card component rendering a thumbnail, title, neon-colored category badge, and play count, linking to the game's detail page with hover glow and scale effects.",
  "frontend/src/components/games/AmongUsGame.tsx": "A canvas-based Among Us-inspired game with AI crewmates and an impostor, featuring room/corridor navigation, task completion, body reporting, and a voting phase to determine the winner.",
  "frontend/src/components/games/BlockBlastGame.tsx": "A neon-styled Block Blast puzzle game rendered on a canvas where players drag and drop Tetris-like pieces onto an 8x8 grid, clearing full rows/columns for points.",
  "frontend/src/components/games/BreakoutGame.tsx": "A neon-themed Breakout/Arkanoid clone rendered on a canvas with a paddle, bouncing ball, and a grid of destructible bricks, tracking score and lives.",
  "frontend/src/components/games/FlappyBirdGame.tsx": "A neon Flappy Bird clone rendered on a canvas where the player taps/clicks to flap a bird through procedurally spawned pipe obstacles, tracking score.",
  "frontend/src/components/games/Game2048.tsx": "A neon-styled 2048 tile-merging puzzle game using React state, supporting keyboard and touch swipe input, with persistent best score via localStorage.",
  "frontend/src/components/games/GeometryDashGame.tsx": "A canvas-based Geometry Dash clone where a cube auto-runs, jumps over spikes and platforms, and spawns neon particles on jump. Tracks score, speed, and game-over state using refs and a requestAnimationFrame loop.",
  "frontend/src/components/games/PacManGame.tsx": "A canvas-based Pac-Man game with a hardcoded maze, dot/power-pellet collection, four colored ghosts with frightened state, smooth grid movement, and lives/score tracking.",
  "frontend/src/components/games/SixSevenGame.tsx": "A clicker game centered on a neon '67' button that increments score with combo multipliers, floating text animations, screen shake/flash effects, and a localStorage-persisted best score.",
  "frontend/src/components/games/SnakeGame.tsx": "A classic Snake game rendered on a canvas with a neon aesthetic, interval-based tick logic, collision detection, food spawning, and localStorage high-score persistence.",
  "frontend/src/components/games/SpaceInvadersGame.tsx": "A canvas-based Space Invaders game featuring animated alien rows, player/enemy bullets, lives, score, and win/lose conditions driven by a requestAnimationFrame game loop.",
  "frontend/src/components/games/SwordsAndSandalsGame.tsx": "A canvas-based gladiator combat game where the player fights an AI opponent using attack, block, and special actions across rounds, with animated sprites, shake/flash effects, and a combat log.",
  "frontend/src/components/games/TetrisGame.tsx": "A fully functional Tetris game rendered on an HTML canvas with standard tetrominoes, ghost piece, line clearing, leveling, score tracking, and a next-piece preview panel.",
  "frontend/src/components/games/TungTungGame.tsx": "A clicker/idle game centered on a 'Tung Tung' character where players click to score points with combo multipliers, floating text effects, screen shake, and neon visual styling on a canvas.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with the 'KASH IS FART' logo using neon green/pink styling and a 'Game Library' link back to the homepage.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider for ICP, exposing login/logout functions, identity state, and login status via a React context and custom hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching games (all, by category, most popular) and mutations for adding a game and incrementing play counts via the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines a dark cyberpunk/neon color theme via CSS custom properties, and adds utility classes for neon text/border/glow effects, scanlines, grid backgrounds, and keyframe animations.",
  "frontend/src/lib/seedGames.ts": "Defines a list of 13 seed games with metadata (title, description, category, thumbnail) and exports a function to populate the backend with these games if they don't already exist.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider for data fetching and InternetIdentityProvider for authentication wrapping the root App component.",
  "frontend/src/pages/GamePage.tsx": "Page component that maps URL title params to specific game components, increments the play count on load, and renders the matched game or a 404 screen if not found.",
  "frontend/src/pages/HomePage.tsx": "Home page that displays a featured game hero, category filter buttons, and a grid of game cards; seeds initial games on first load and navigates to individual game pages on play.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with Orbitron/Rajdhani fonts, oklch-based semantic color tokens, neon color palette, custom box shadows, and neon-pulse/float animations.",
  "project_state.json": "Project state manifest tracking schema version, feature list, architectural notes, and known issues for a web-based multi-game arcade platform inspired by Geometry Dash."
}