{
  "backend/main.mo": "Motoko actor defining a Game catalog with CRUD operations: add, retrieve (all, by category, by title, most popular), increment play count, and delete games, stored in a Map keyed by title.",
  "feature_evidence.json": "Feature evidence report documenting a single feature request to visually differentiate each SoundpadPage button with unique icons, accent colors, and styles reflecting its sound, while retaining the neon arcade theme.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files, describing each component, page, hook, and utility in the project for build planning reference.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark color themes including background, foreground, card, border, and chart tokens.",
  "frontend/index.html": "HTML entry point for the Random Arcade app, loading Exo 2 and Chakra Petch Google Fonts and mounting the React app via /src/main.tsx.",
  "frontend/src/App.tsx": "TanStack Router and React Query setup defining root layout with Navigation/Footer, and routes for HomePage (/), GamePage (/game/$title), and SoundpadPage (/soundpad).",
  "frontend/src/components/FeaturedGameHero.tsx": "Hero banner component displaying a featured game's thumbnail, title, description, play count, category badge, and a neon orange Play Now button.",
  "frontend/src/components/Footer.tsx": "Footer component showing the Random Arcade brand, dynamic copyright year, and a caffeine.ai attribution link with UTM parameters.",
  "frontend/src/components/GameCard.tsx": "Game card component rendering a thumbnail, title, category badge, and play count with category-specific neon color theming and a hover play button overlay.",
  "frontend/src/components/games/AmongUsGame.tsx": "Empty file with no content; likely a placeholder for an Among Us mini-game component.",
  "frontend/src/components/games/AsteroidsGame.tsx": "A canvas-based Asteroids game component with ship movement, bullet firing, asteroid splitting, collision detection, and sound effects via useSoundEffect hook.",
  "frontend/src/components/games/BlockBlastGame.tsx": "Empty file with no content.",
  "frontend/src/components/games/BreakoutGame.tsx": "Empty file with no content.",
  "frontend/src/components/games/DinoRunnerGame.tsx": "A canvas-based endless runner game where a dinosaur jumps over procedurally spawned cacti, with increasing speed, score milestones, and sound effects.",
  "frontend/src/components/games/FlappyBirdGame.tsx": "Empty file with no content.",
  "frontend/src/components/games/Game2048.tsx": "Empty file with no content.",
  "frontend/src/components/games/GeometryDashGame.tsx": "Empty file with no content.",
  "frontend/src/components/games/MemoryMatchGame.tsx": "A React-based memory card matching game with 8 emoji symbol pairs, move counter, elapsed timer, and win detection.",
  "frontend/src/components/games/MinesweeperGame.tsx": "A 9x9 Minesweeper game with mine placement on first click, flood-fill reveal, flagging, win/loss detection, and an elapsed timer.",
  "frontend/src/components/games/PacManGame.tsx": "Empty file with no content.",
  "frontend/src/components/games/PongGame.tsx": "A canvas-based two-player Pong game with keyboard controls, angle-based paddle deflection, score tracking up to 7, and sound effects.",
  "frontend/src/components/games/RetroBowlGame.tsx": "A full-featured retro-style American football game rendered on an HTML5 canvas, implementing game phases, player/defender AI, passing, running, field goals, scoring, and HUD display.",
  "frontend/src/components/games/SixSevenGame.tsx": "Empty file with no content or implementation.",
  "frontend/src/components/games/SnakeGame.tsx": "Empty file with no content or implementation.",
  "frontend/src/components/games/SpaceInvadersGame.tsx": "Empty file with no content or implementation.",
  "frontend/src/components/games/SwordsAndSandalsGame.tsx": "A turn-based gladiator combat game rendered on a canvas where the player chooses attack, block, or special actions against an AI enemy, with shake/flash animations and sound effects.",
  "frontend/src/components/games/TetrisGame.tsx": "Empty file with no content or implementation.",
  "frontend/src/components/games/TungTungGame.tsx": "Empty file with no content or implementation.",
  "frontend/src/components/games/WhackAMoleGame.tsx": "A 30-second whack-a-mole game with a 9-hole grid where moles randomly appear and disappear, tracking score and using sound effects for pops, whacks, and game over.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with the Random Arcade logo/brand and links to the Game Library (/) and Soundpad (/soundpad) routes.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching games (all, by category, most popular), incrementing play counts, and adding new games via the ICP backend actor.",
  "frontend/src/hooks/useSoundEffect.ts": "A React hook that wraps the Web Audio API to provide reusable sound primitives (tones, sweeps, noise bursts) and higher-level retro game sound effects like pass throws, touchdowns, and tackles.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines CSS custom properties for a dark neon-themed design system, and provides utility classes for neon text/glow effects, scanlines, and custom fonts.",
  "frontend/src/lib/seedGames.ts": "Defines a static list of seed game entries and exports a function that checks existing games and adds any missing ones to the backend via provided actor methods.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/GamePage.tsx": "A route page that maps URL title parameters to specific game components, increments the play count on mount, and renders the matched game or a 404 state.",
  "frontend/src/pages/HomePage.tsx": "The main landing page that seeds initial games on load, displays a featured game hero, category filter buttons, and a grid of game cards with loading skeletons.",
  "frontend/src/pages/SoundpadPage.tsx": "An interactive soundboard page that renders a grid of styled buttons, each triggering a specific sound effect from the useSoundEffect hook with visual active-state feedback.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the theme with custom fonts (Chakra Petch, Exo 2), neon color palette, oklch-based semantic colors, neon box shadows, and keyframe animations like neon-pulse and float.",
  "project_state.json": "Project state tracking file (version 45) describing Random Arcade, a web-based gaming platform with 17+ browser games, recording existing features, architectural notes, known issues, and a new soundpad sub-project."
}