{
  "backend/main.mo": "Motoko actor defining a game library backend with CRUD operations for games, including addGame, getAllGames, getGamesByCategory, incrementPlayCount, getMostPopularGames, getGameByTitle, and deleteGame, using a Map for storage and a blob storage mixin.",
  "feature_evidence.json": "Feature evidence report mapping three features—the 67 Clicker game component, its GamePage routing registration, and its seedGames entry—to their respective source files and test IDs.",
  "frontend-file-summaries.txt": "A JSON document summarizing each frontend source file's purpose, covering styles, hooks, pages, game components, and utility modules across the project.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark color themes used throughout the UI.",
  "frontend/index.html": "HTML entry point that loads Orbitron and Rajdhani fonts from Google Fonts, sets the page title to 'Kash is Fart', and mounts the React app.",
  "frontend/src/App.tsx": "Root React app setup using TanStack Router with a Layout wrapping Navigation and Footer, and routes for the HomePage (/) and dynamic GamePage (/game/$title), wrapped in a React Query provider.",
  "frontend/src/components/FeaturedGameHero.tsx": "Hero banner component that prominently displays a featured game's thumbnail, title, description, play count, category, and a 'Play Now' CTA button with neon arcade styling.",
  "frontend/src/components/Footer.tsx": "Site footer displaying the 'KASH IS FART' brand, copyright year, and a caffeine.ai attribution link with UTM tracking.",
  "frontend/src/components/GameCard.tsx": "Reusable card component that links to a game's page, showing its thumbnail, title, neon-colored category badge, and play count with hover glow effects.",
  "frontend/src/components/games/AmongUsGame.tsx": "Implements a canvas-based Among Us-inspired mini-game with AI crewmates/impostors, room/corridor map layout, task completion, kill mechanics, and a voting phase.",
  "frontend/src/components/games/BlockBlastGame.tsx": "Canvas-based block blast puzzle game where players drag neon-colored pieces onto an 8x8 grid, clearing full rows and columns for points.",
  "frontend/src/components/games/BreakoutGame.tsx": "Canvas-based Breakout/Arkanoid clone with neon visuals, paddle/ball physics, brick collision, lives system, and score tracking.",
  "frontend/src/components/games/FlappyBirdGame.tsx": "Canvas-based Flappy Bird clone with a neon aesthetic, gravity/flap physics, procedurally spawned pipes, and score display.",
  "frontend/src/components/games/Game2048.tsx": "React implementation of the 2048 sliding tile puzzle with neon-colored tiles, swipe/keyboard input, score tracking, and local best-score persistence.",
  "frontend/src/components/games/GeometryDashGame.tsx": "A canvas-based Geometry Dash clone where a cube jumps over spikes and platforms with neon visuals, particle effects, and increasing speed. Handles game loop, collision detection, obstacle spawning, and score tracking.",
  "frontend/src/components/games/PacManGame.tsx": "A canvas-based Pac-Man game with a predefined maze, dot/power-pellet collection, four colored ghosts with frightened state, smooth movement, and lives/score tracking.",
  "frontend/src/components/games/SixSevenGame.tsx": "A clicker game centered on clicking a neon '67' button to accumulate score with combo multipliers, floating text animations, screen shake/flash effects, and localStorage-persisted best score.",
  "frontend/src/components/games/SnakeGame.tsx": "A classic Snake game rendered on a canvas with neon styling, tracking score and high score in localStorage, using a setInterval game loop and keyboard controls.",
  "frontend/src/components/games/SpaceInvadersGame.tsx": "A canvas-based Space Invaders game featuring a player ship, four rows of animated aliens, player and enemy bullets, lives, score, and win/lose conditions.",
  "frontend/src/components/games/SwordsAndSandalsGame.tsx": "A canvas-based gladiator combat game where the player fights an AI opponent using attack, block, and special actions across rounds, with animated sprites, shake/flash effects, and a combat log.",
  "frontend/src/components/games/TetrisGame.tsx": "A fully functional Tetris game rendered on an HTML canvas with standard tetrominoes, ghost piece, line clearing, leveling, score tracking, and a next-piece preview.",
  "frontend/src/components/games/TungTungGame.tsx": "A clicker game where the player clicks a neon-styled drum to score points with combo multipliers, floating score text, and animated drum visuals rendered on a canvas.",
  "frontend/src/components/Navigation.tsx": "Renders a sticky top navigation bar with a logo linking to the home page and a 'Game Library' nav link, styled with neon colors.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and delegation validity checks.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching games (all, by category, most popular), incrementing play counts, and adding new games via the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines a dark cyberpunk/neon color theme via CSS custom properties, and adds utility classes for neon text/border/glow effects, scanlines, and grid backgrounds.",
  "frontend/src/lib/seedGames.ts": "Defines a list of 13 seed games with metadata (title, description, category, thumbnail) and exports a function to populate the backend with these games if they don't already exist.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider for data fetching and InternetIdentityProvider for authentication wrapping the root App component.",
  "frontend/src/pages/GamePage.tsx": "Page component that maps URL title params to specific game components, increments play count on load, and renders the appropriate game or a 404 message if the game is not found.",
  "frontend/src/pages/HomePage.tsx": "Home page that displays a featured game hero, category filter buttons, and a grid of game cards; also triggers seeding of initial games into the backend on first load.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with neon color palette, Orbitron/Rajdhani fonts, neon box-shadow utilities, and keyframe animations for neon-pulse and float effects.",
  "project_state.json": "Project state manifest tracking version, summary, architectural notes, known issues, image requirements, and a list of existing implemented game features for the web-based gaming platform."
}