{
  "kind": "build_request",
  "title": "Update Soundpad button visuals to reflect their corresponding sounds",
  "projectName": "Random Arcade",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-70",
      "text": "Update each button in the SoundpadPage (frontend/src/pages/SoundpadPage.tsx) so that its visual design — including icon, accent color, label style, and/or button shape — reflects the character and feel of its corresponding sound. For example: 'Fart' gets a puff/cloud icon and a sickly green tint; 'Airhorn' gets a bold red/orange color and a megaphone icon; 'Sad Trombone' gets a muted yellow/brown tone and a music note; 'Crickets' gets a muted green and a bug icon; 'Evil Laugh' gets a deep purple with a skull/laugh icon; '67' gets a neon orange flash styling. Each button must retain the existing press/active animation and the overall neon arcade theme (dark background, Chakra Petch or Exo 2 font), but differ from one another visually so a user can identify the button's sound at a glance without reading the label.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Make it seem more like the sounds"
        ]
      },
      "acceptanceCriteria": [
        "Every button on SoundpadPage has a distinct accent color that matches the mood/feel of its sound (e.g., bright red for Airhorn, sickly green for Fart, deep purple for Evil Laugh).",
        "Each button displays a small thematic icon or emoji that visually represents its sound.",
        "No two buttons share the same color + icon combination.",
        "The existing press/active state animation is preserved on all buttons.",
        "The page retains the dark neon arcade theme (near-black background, Chakra Petch or Exo 2 typography, neon glow effects).",
        "The '67' button has a visually distinct style consistent with its neon orange/cyan accent established in the previous feature.",
        "All 16+ sound buttons remain functional and trigger their corresponding Web Audio API sound on click."
      ]
    }
  ],
  "constraints": [
    "Do not modify files listed in frontend.immutablePaths.",
    "All sounds must continue to be synthesized via the Web Audio API — no external audio files.",
    "Retain the existing press/active animation behavior on all soundpad buttons."
  ],
  "nonGoals": [
    "Adding new sound buttons beyond those already present.",
    "Changing the underlying sound synthesis logic in useSoundEffect.ts.",
    "Modifying any game components or backend logic.",
    "Changing the overall page layout or navigation structure."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}